In [7]:
import pandas as pd
users_data=pd.read_csv("users_data.csv",index_col=0)
users_data

,Name,Age,Gender,Marital Status,City,Occupation,Salary,Hobby
0,Mary,28,M,Divorced,Addis Ababa,Product Manager,286584,Travelling
1,Napoleon,41,M,Single,Nairobi,Data Analyst,88044,Reading novels
2,Hill,36,M,Divorced,Addis Ababa,Plumber,101214,Travelling
3,Wambley,32,M,Divorced,Kampala,Product Manager,242300,Swimming
4,Ndege,29,M,Single,Addis Ababa,Product Manager,164752,Reading novels
5,Noel,42,M,Divorced,Dakar,Data Analyst,98984,Swimming
6,Peter,28,M,Single,Dakar,Product Manager,90774,Travelling
7,John,47,M,Single,Dakar,Product Manager,52568,Watching movies
8,Maryanne,40,F,Married,Dakar,Data Analyst,170151,Reading novels
9,Hillary,44,F,Single,Kampala,Data Analyst,243664,Travelling
10,Marion,32,M,Married,Lagos,Teacher,248635,Watching movies
11,Claire,32,M,Single,Mogadishu,Plumber,183767,Watching movies
12,Cherry,45,M,Single,Nairobi,Plumber,174375,Swimming
13,Pine,42,F,Married,Dakar,Product Manager,229262,Travelling
14,Stone,25,M,Married,Addis Ababa,Plumber,186330,Watching movies
15,Veronica,29,F,Single,Dakar,Product Manager,268610,Reading novels
16,Esther,45,F,Divorced,Addis Ababa,Teacher,89504,Reading novels
17,Andrew,24,F,Married,Mogadishu,Data Analyst,214231,Swimming
18,James,43,F,Divorced,Mogadishu,Data Analyst,63986,Watching movies
19,Nelly,42,F,Divorced,Mogadishu,Data Analyst,111858,Travelling